{
  "task": "table_selection_task.txt",
  "template": "<database_list>{database_list}</database_list>\n<user_query>{user_query}</user_query>",
  "examples": [
    {
      "user": "<database_list>\n  <database>\n    <name>football_tactics</name>\n    <description>Focuses on advanced football tactics and strategic play, emphasizing modern innovations. Contains detailed analyses of specific tactical concepts, their historical development, and implementation by top teams and coaches.</description>\n  </database>\n  <database>\n    <name>football_history</name>\n    <description>Covers the historical development of football, including major events, rule changes, and cultural impacts. Contains academic articles and historical accounts spanning multiple decades, focusing on how the sport has changed over time.</description>\n  </database>\n</database_list>\n<user_query>How has the role of defensive midfielders evolved in modern football tactics?</user_query>",
      "assistant": "{ \"response\": \"football_tactics\", \"confidence\": 0.95 }"
    },
    {
      "user": "<database_list>\n  <database>\n    <name>climate_change_effects</name>\n    <description>Contains research on the various impacts of climate change, including rising temperatures, extreme weather events, and sea-level rise. Includes scientific studies, projections, and case studies from around the world.</description>\n  </database>\n  <database>\n    <name>marine_biology</name>\n    <description>Focuses on the study of marine organisms, their behaviors, and their interactions with the environment. Covers topics such as marine ecosystems, biodiversity, and conservation efforts.</description>\n  </database>\n  <database>\n    <name>environmental_policy</name>\n    <description>Examines environmental regulations, international agreements, and policy proposals related to various environmental issues. Includes analysis of policy effectiveness and economic impacts.</description>\n  </database>\n</database_list>\n<user_query>What are the potential impacts of rising sea levels on coastal ecosystems?</user_query>",
      "assistant": "{ \"response\": \"climate_change_effects\", \"confidence\": 0.9 }"
    },
    {
      "user": "<database_list>\n  <database>\n    <name>quantum_physics</name>\n    <description>Covers fundamental principles of quantum mechanics, including wave-particle duality, superposition, and entanglement. Contains theoretical papers and experimental results in the field of quantum physics.</description>\n  </database>\n  <database>\n    <name>computer_science_innovations</name>\n    <description>Focuses on cutting-edge developments in various areas of computer science, including artificial intelligence, blockchain, and quantum computing. Includes research papers, industry reports, and analysis of potential applications.</description>\n  </database>\n  <database>\n    <name>technology_trends</name>\n    <description>Provides an overview of emerging technologies across various sectors. Includes market analysis, consumer adoption trends, and predictions for future technological developments.</description>\n  </database>\n</database_list>\n<user_query>What are the latest advancements in quantum computing and their potential applications?</user_query>",
      "assistant": "{ \"response\": \"computer_science_innovations\", \"confidence\": 0.85 }"
    },
    {
      "user": "<database_list>\n  <database>\n    <name>world_economics</name>\n    <description>Contains data on global economic trends, including GDP, inflation rates, and trade statistics for various countries.</description>\n  </database>\n  <database>\n    <name>space_exploration</name>\n    <description>Focuses on the history and current developments in space exploration, including missions, technologies, and scientific discoveries.</description>\n  </database>\n  <database>\n    <name>classical_literature</name>\n    <description>A comprehensive collection of classical literature works, including analyses and critiques of major authors and literary movements.</description>\n  </database>\n</database_list>\n<user_query>What is the best way to train a pet parrot?</user_query>",
      "assistant": "{ \"response\": \"world_economics\", \"confidence\": 0.05 }"
    },
    {
      "user": "<database_list>\n  <database>\n    <name>environmental_issues</name>\n    <description>Covers various environmental problems, their causes, and potential solutions. Includes topics such as climate change, pollution, deforestation, and biodiversity loss.</description>\n  </database>\n  <database>\n    <name>south_american_geography</name>\n    <description>Focuses on the physical and human geography of South America, including information about countries, landscapes, and major geographical features.</description>\n  </database>\n</database_list>\n<user_query>What are the main causes of deforestation in the Amazon rainforest?</user_query>",
      "assistant": "{ \"response\": \"south_american_geography\", \"confidence\": 0.8 }",
      "feedback": "Incorrect selection. The 'environmental_issues' database is more relevant to the query about deforestation causes in the Amazon rainforest.",
      "correction": "{ \"response\": \"environmental_issues\", \"confidence\": 0.95 }"
    },
    {
      "user": "<database_list>\n  <database>\n    <name>chess_fundamentals</name>\n    <description>Covers all aspects of chess, including rules, strategies, famous games, and player profiles. Suitable for beginners and advanced players alike.</description>\n  </database>\n  <database>\n    <name>board_games</name>\n    <description>General information about various board games, their history, and cultural significance.</description>\n  </database>\n</database_list>\n<user_query>What are the basic rules of chess?</user_query>",
      "assistant": "{ \"response\": \"chess_fundamentals\", \"confidence\": 0.6 }",
      "feedback": "While the correct database was selected, the confidence score is inappropriately low. Given the perfect match between the query and the 'chess_fundamentals' database description, the confidence should be much higher (close to 1.0).",
      "correction": "{ \"response\": \"chess_fundamentals\", \"confidence\": 0.98 }"
    }
  ]
}
