{
  "deal_general_information": "<guidelines>Name: Deal/Loan General Information\nThe main items for the high-level information about loan details are the parties that are involved in the credit agreement along with the signing date, loan amount, and all other parties involved like Banks and agents. Look for this information typically in the opening recitals, preamble, or first few sections of the agreement. Pay attention to defined terms in parentheses or quotation marks.\nThis section includes the following:\n- Borrower Name (legal entity name as written in agreement)\n- Commitment Amount (Minimum and Maximum amounts in specified currency)\n- Signing Date (execution date of agreement)\n- Purpose (specific use of proceeds stated in purpose/use of proceeds section) \n- Parties involved (All Banks, administrative agents, collateral agents, etc. with roles clearly specified)</guidelines>",

  "tranche_information": "<guidelines>Name: Tranche Information\nWe need to look into the credit agreement if the loan has multiple tranches or a single-tranche loan. Each tranche has a minimum and maximum loan amount and the details of the repayment schedule. Look for terms like 'Facility', 'Tranche', or 'Term Loan' followed by letters (A,B,C) or numbers. Check commitment tables and repayment schedules carefully.\nThis section includes the following:\n- Number of tranches (total count of distinct facilities/tranches)\n- Minimum loan amount per tranche (stated floor amount for each tranche)\n- Maximum loan amount per tranche (stated ceiling amount for each tranche)\n- Repayment schedule details (amortization schedule with specific dates and amounts)</guidelines>",

  "interest_and_fees": "<guidelines>Name: Interest and Fees\nEach loan agreement is tied with multiple fees and we need to identify those information. Look in 'Interest' and 'Fees' sections for specific rate calculations and fee structures. Pay attention to defined terms for different types of fees. Check for tables showing fee calculations.\nThis section includes the following:\n- Base Rate (specified benchmark rate - LIBOR, SOFR, etc.)\n- Spread (margin above base rate in basis points)\n- CSA (Credit Support Annex adjustments if any)\n- Floor (BR) % (minimum base rate percentage)\n- Fee Type (commitment fees, ticking fees, upfront fees, etc.)\n- Max Fee (maximum fee percentage or amount for each type)</guidelines>",

  "financial_covenants": "<guidelines>Name: Financial Covenants\nThis information is usually mentioned in the Covenant section of the credit agreement. Look for specific ratio definitions and calculations. Check for tables showing required levels over time. Pay attention to testing periods and compliance certificates.\nThis section includes the following:\n- Ratio Type* (Leverage Ratio, Interest Coverage Ratio, etc.)\n- Level (numerical threshold for each ratio)\n- Start Date (when covenant testing begins)\n- End Date (when covenant requirement ends)\n- Dividend Restriction (specific limitations on distributions)\n- Covenant Type* (maintenance vs incurrence)\n- Level (required threshold)\n- Start Date* (effective date)\n- End Date (termination date)\n- Capex Carryover (allowed capital expenditure carryover amount)\n- Net Worth Type* (tangible net worth, etc.)\n- Base Amount (starting amount)\n- % of Net Income (percentage of income to be maintained)\n- Build Up (incremental build-up provisions)</guidelines>",

  "pricing_grid_information": "<guidelines>Name: Pricing Grid Information\nThe pricing grid is usually shown in a table format showing different interest rate levels based on financial metrics. Look for terms like 'Applicable Rate' or 'Applicable Margin'. Check for specific ratio breakpoints and corresponding rates.\nThis section includes the following:\n- Split Rated? (yes/no if different ratings apply)\n- Split By > 1 Lev? (multiple leverage breakpoints)\n- Performance Types - Performance Price Code (specific metrics used)\n- Performance Types - Column Number (number of pricing tiers)\n- Grid - Min Op (minimum operator for each tier)\n- Grid - xyz Min (minimum threshold for each metric)\n- Grid - Max Op (maximum operator for each tier)\n- Grid - xyz Max (maximum threshold for each metric)\n- Base Rates (applicable base rates per tier)\n- Fees (applicable fees per tier)</guidelines>",

  "tranche_bank_list": "<guidelines>Name: Tranche Bank List\nLook for commitment schedules or tables showing lender commitments. Check signature pages for bank roles. Pay attention to defined roles in the agreement.\nThis section includes the following:\n- Lender Name (legal name of each lending institution)\n- Primary role (main role of each lender)\n- Agent Only (yes/no if purely agent role)\n- Lead Arranger (yes/no if lead arranger)\n- Agent/Co-Agent (specific agent designation)\n- Role (detailed role description)\n- Commitment (Minimum / Maximum amounts per lender)\n- Percent Share (percentage of total commitment)</guidelines>",

  "tranche_options_base_repays": "<guidelines>Name: Tranche Options/Base/Repays\nLook in repayment sections for specific repayment terms. Check for optional prepayment provisions and scheduled amortization.\nThis section includes the following:\n- Period (repayment interval)\n- Number of Periods (total number of payments)\n- Amount (payment amount per period)\n- Percent (percentage of original principal)\n- Begin Date (start date of repayments)</guidelines>",

  "tranche_main_page": "<guidelines>Name: Tranche Main Page\nLook for facility-specific terms in the main body of the agreement. Check definitions section for tranche types.\nThis section includes the following:\n- Tranche Type (revolving, term, etc.)\n- Distribution Method (pro rata, non-pro rata)\n- Maturity Date (final maturity date)\n- Currency (specified currency for the tranche)\n- Amount (Minimum / Maximum commitment amounts)\n- LT Amount and Date (long-term amount and effective date)</guidelines>",

  "covenants_and_amendment_voting": "<guidelines>Name: Covenants and Amendment Voting\nLook in prepayment and amendment sections for specific provisions. Check for required lender votes for modifications.\nThis section includes the following:\n- Prepayment Type (mandatory, optional, asset sale, etc.)\n- Prepayment Percent (required percentage to be prepaid)\n- Prepayment Comment (specific conditions and requirements)</guidelines>"
}
